module.exports = {
  content: ['./src/**/*.{js,ts,jsx,tsx}'],
  theme: {
    fontSize: {
      xs: '0.75rem',
      sm: '0.875rem',
      base: '1rem',
      lg: '1.125rem',
      xl: '1.25rem',
      '2xl': '1.5rem',
      '3xl': '1.875rem',
      '4xl': '2.25rem',
      '5xl': '3rem',
      '6xl': '4rem',
    },
    extend: {
      colors: {
        primary: {
  100: '#FDECEA',   // очень светлый красный
  200: '#F9C9C3',   // светло-розовый
  300: '#F4A6A0',   // нежный красный
  400: '#EF6C64',   // яркий коралловый
  500: '#EB3B2F',   // насыщенный красный (аналог #03A9F4)
  600: '#D5342A',   // чуть темнее
  700: '#98251F',   // глубокий красный
  800: '#6F1C18',   // бордовый
  900: '#47130F',   // тёмный винный
},
        gray: {
          100: '#f7fafc',
          200: '#edf2f7',
          300: '#e2e8f0',
          400: '#cbd5e0',
          500: '#a0aec0',
          600: '#718096',
          700: '#4a5568',
          800: '#2d3748',
          900: '#1a202c',
        },
      },
      lineHeight: {
        hero: '4.5rem',
      },
    },
  },
  plugins: [],
};
